novalabsxyz/cc13x2-cc26x2-pac/cc2652r1f.svd
Write OP1_VALUE to set upper half of signed 32-bit operand and trigger the following operation:

When lower half of 32-bit operand was written to OP0S.OP0_VALUE: ACC = ACC + (( OP1_VALUE &lt;&lt; 16) | OP0S.OP0_VALUE ).
When lower half of 32-bit operand was written to OP0U.OP0_VALUE: ACC = ACC + (( OP1_VALUE &lt;&lt; 16) | OP0U.OP0_VALUE ).</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>OP1UADD32</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>Unsigned Operand 1 and 32-bit Addition</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>OP1_VALUE</name>
              <description>[15:0] Upper half of unsigned 32-bit operand and addition trigger.

Write OP1_VALUE to set upper half of unsigned 32-bit operand and trigger the following operation:

When lower half of 32-bit operand was written to OP0S.OP0_VALUE: ACC = ACC + (( OP1_VALUE &lt;&lt; 16) | OP0S.OP0_VALUE ).
When lower half of 32-bit operand was written to OP0U.OP0_VALUE: ACC = ACC + (( OP1_VALUE &lt;&lt; 16) | OP0U.OP0_VALUE ).</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CLZ</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>Count Leading Zero</description>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[5:0] Number of leading zero bits in the accumulator:

0x00: 0 leading zeros.
0x01: 1 leading zero.
... 
0x28: 40 leading zeros (accumulator value is 0).</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x28</resetValue>
        </register>
        <register>
          <name>CLS</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>Count Leading Sign</description>
          <fields>
            <field>
              <name>RESERVED6</name>
              <description>[31:6] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>26</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[5:0] Number of leading sign bits in the accumulator.

When MSB of accumulator is 0, VALUE is number of leading zeros, MSB included.
When MSB of accumulator is 1, VALUE is number of leading ones, MSB included.

VALUE range is 1 thru 40.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x28</resetValue>
        </register>
        <register>
          <name>ACCSHIFT</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>Accumulator Shift 

Only one shift operation can be triggered per register write.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>LSL1</name>
              <description>[2:2] Logic shift left by 1 bit.

Write 1 to shift the accumulator one bit to the left, 0 inserted at bit 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>LSR1</name>
              <description>[1:1] Logic shift right by 1 bit.

Write 1 to shift the accumulator one bit to the right, 0 inserted at bit 39.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>ASR1</name>
              <description>[0:0] Arithmetic shift right by 1 bit.

Write 1 to shift the accumulator one bit to the right, previous sign bit inserted at bit 39.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACCRESET</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>Accumulator Reset</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>TRG</name>
              <description>[15:0] Write any value to this register to trigger a reset of all bits in the accumulator.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC15_0</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 15:0</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 15:0.

Write VALUE to initialize bits 15:0 of accumulator.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC16_1</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 16:1</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 16:1.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC17_2</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 17:2</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 17:2.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC18_3</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 18:3</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 18:3.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC19_4</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 19:4</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 19:4.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC20_5</name>
          <addressOffset>0x4c</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 20:5</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 20:5.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC21_6</name>
          <addressOffset>0x50</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 21:6</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 21:6.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC22_7</name>
          <addressOffset>0x54</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 22:7</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 22:7.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC23_8</name>
          <addressOffset>0x58</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 23:8</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 23:8.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC24_9</name>
          <addressOffset>0x5c</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 24:9</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 24:9.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC25_10</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 25:10</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 25:10.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC26_11</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 26:11</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 26:11.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC27_12</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 27:12</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 27:12.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC28_13</name>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 28:13</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 28:13.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC29_14</name>
          <addressOffset>0x70</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 29:14</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 29:14.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC30_15</name>
          <addressOffset>0x74</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 30:15</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 30:15.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ACC31_16</name>
          <addressOffset>0x78</addressOffset>
          <size>32</size>
          <description>Accumulator Bits 31:16</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Value of the accumulator, bits 31:16.

