novalabsxyz/cc13x2-cc26x2-pac/cc2652r1f.svd
Configure source for Timer 0 prescaler.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TICK</name>
                  <value>1</value>
                  <description>Use event set by TICK_SRC as source for prescaler.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK</name>
                  <value>0</value>
                  <description>Use clock as source for prescaler. Note that AUX_SYSIF:PEROPRATE.TIMER01_OP_RATE sets the clock frequency.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RELOAD</name>
              <description>[0:0] Timer 0 reload mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONT</name>
                  <value>1</value>
                  <description>Continuous mode.

Timer 0 restarts when the counter value becomes equal to or greater than ( T0TARGET.VALUE - 1).</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN</name>
                  <value>0</value>
                  <description>Manual mode.

Timer 0 stops and T0CTL.EN becomes 0 when the counter value becomes equal to or greater than T0TARGET.VALUE.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T0CTL</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Timer 0 Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Timer 0 enable.

0: Disable Timer 0.
1: Enable Timer 0.

The counter restarts from 0 when you enable Timer 0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T0TARGET</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Timer 0 Target</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Timer 0 target value.

Manual Reload Mode:
- Timer 0 increments until the counter value becomes equal to or greater than VALUE. 
- AUX_TIMER0_EV pulses high for 1 peripheral clock period when the counter value is equal to or greater than VALUE.

Note: When VALUE is 0, Timer 0 counts to 1. AUX_TIMER0_EV pulses high for 1 peripheral clock period.

Continuous Reload Mode:
- Timer 0 increments until the counter value becomes equal to or greater than ( VALUE - 1), then restarts from 0.
- AUX_TIMER0_EV pulses high for 1 peripheral clock period when the counter value is 0, except for when you enable the timer.

Note: When VALUE is less than 2, Timer 0 counter value remains 0. AUX_TIMER0_EV goes high and remains high 1 peripheral clock period after you enable the timer.


It is allowed to update the VALUE while the timer runs.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T0CNTR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Timer 0 Counter</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>VALUE</name>
              <description>[15:0] Timer 0 counter value.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T1CFG</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Timer 1 Configuration</description>
          <fields>
            <field>
              <name>RESERVED15</name>
              <description>[31:15] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>17</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>TICK_SRC_POL</name>
              <description>[14:14] Tick source polarity for Timer 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>14</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>FALL</name>
                  <value>1</value>
                  <description>Count on falling edges of TICK_SRC.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>RISE</name>
                  <value>0</value>
                  <description>Count on rising edges of TICK_SRC.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>TICK_SRC</name>
              <description>[13:8] Select Timer 1 tick source from the synchronous event bus.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>8</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_TIMER2_CLKSW_RDY</name>
                  <value>63</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_CLKSWITCH_RDY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_DAC_HOLD_ACTIVE</name>
                  <value>62</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_DAC_HOLD_ACTIVE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_SMPH_AUTOTAKE_DONE</name>
                  <value>61</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_SMPH_AUTOTAKE_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_NOT_EMPTY</name>
                  <value>60</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_NOT_EMPTY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_FIFO_ALMOST_FULL</name>
                  <value>59</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_FIFO_ALMOST_FULL</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_IRQ</name>
                  <value>58</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_IRQ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ADC_DONE</name>
                  <value>57</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ADC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_ISRC_RESET_N</name>
                  <value>56</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_ISRC_RESET_N</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TDC_DONE</name>
                  <value>55</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TDC_DONE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER0_EV</name>
                  <value>54</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER0_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NO_EVENT</name>
                  <value>53</value>
                  <description>No event.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_PULSE</name>
                  <value>52</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_PULSE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV3</name>
                  <value>51</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV2</name>
                  <value>50</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV1</name>
                  <value>49</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>48</value>
                  <description>AUX_EVCTL:EVSTAT3.AUX_TIMER2_EV0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPB</name>
                  <value>47</value>
                  <description>AUX_EVCTL:EVSTAT2.AUX_COMPB</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUX_COMPA</name>
                  <value>46</value>
                  <description>AUX_EVCTL:EVSTAT2.AUX_COMPA</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_OBSMUX1</name>
                  <value>45</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_OBSMUX1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_OBSMUX0</name>
                  <value>44</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_OBSMUX0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_EV</name>
                  <value>43</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>ACLK_REF</name>
                  <value>42</value>
                  <description>AUX_EVCTL:EVSTAT2.ACLK_REF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>VDDR_RECHARGE</name>
                  <value>41</value>
                  <description>AUX_EVCTL:EVSTAT2.VDDR_RECHARGE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MCU_ACTIVE</name>
                  <value>40</value>
                  <description>AUX_EVCTL:EVSTAT2.MCU_ACTIVE</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>PWR_DWN</name>
                  <value>39</value>
                  <description>AUX_EVCTL:EVSTAT2.PWR_DWN</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SCLK_LF</name>
                  <value>38</value>
                  <description>AUX_EVCTL:EVSTAT2.SCLK_LF</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_BATMON_TEMP_UPD</name>
                  <value>37</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_BATMON_TEMP_UPD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_BATMON_BAT_UPD</name>
                  <value>36</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_BATMON_BAT_UPD</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_4KHZ</name>
                  <value>35</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_4KHZ</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2_DLY</name>
                  <value>34</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2_DLY</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AON_RTC_CH2</name>
                  <value>33</value>
                  <description>AUX_EVCTL:EVSTAT2.AON_RTC_CH2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MANUAL_EV</name>
                  <value>32</value>
                  <description>AUX_EVCTL:EVSTAT2.MANUAL_EV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO31</name>
                  <value>31</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO31</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO30</name>
                  <value>30</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO30</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO29</name>
                  <value>29</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO29</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO28</name>
                  <value>28</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO28</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO27</name>
                  <value>27</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO27</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO26</name>
                  <value>26</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO26</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO25</name>
                  <value>25</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO25</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO24</name>
                  <value>24</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO24</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO23</name>
                  <value>23</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO23</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO22</name>
                  <value>22</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO22</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO21</name>
                  <value>21</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO21</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO20</name>
                  <value>20</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO20</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO19</name>
                  <value>19</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO19</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO18</name>
                  <value>18</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO18</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO17</name>
                  <value>17</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO17</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO16</name>
                  <value>16</value>
                  <description>AUX_EVCTL:EVSTAT1.AUXIO16</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO15</name>
                  <value>15</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO15</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO14</name>
                  <value>14</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO14</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO13</name>
                  <value>13</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO13</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO12</name>
                  <value>12</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO12</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO11</name>
                  <value>11</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO11</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO10</name>
                  <value>10</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO10</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO9</name>
                  <value>9</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO9</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO8</name>
                  <value>8</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO8</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO7</name>
                  <value>7</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO7</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO6</name>
                  <value>6</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO6</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO5</name>
                  <value>5</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO5</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO4</name>
                  <value>4</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO4</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO3</name>
                  <value>3</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO3</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO2</name>
                  <value>2</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO2</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO1</name>
                  <value>1</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO1</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>AUXIO0</name>
                  <value>0</value>
                  <description>AUX_EVCTL:EVSTAT0.AUXIO0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>PRE</name>
              <description>[7:4] Prescaler division ratio is 2^PRE:

0x0: Divide by 1.
0x1: Divide by 2.
0x2: Divide by 4.
... 
0xF: Divide by 32,768.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[3:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MODE</name>
              <description>[1:1] Timer 1 mode.

Configure source for Timer 1 prescaler.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TICK</name>
                  <value>1</value>
                  <description>Use event set by TICK_SRC as source for prescaler.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>CLK</name>
                  <value>0</value>
                  <description>Use clock as source for prescaler. Note that AUX_SYSIF:PEROPRATE.TIMER01_OP_RATE sets the clock frequency.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>RELOAD</name>
              <description>[0:0] Timer 1 reload mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>CONT</name>
                  <value>1</value>
                  <description>Continuous mode.

Timer 1 restarts when the counter value becomes equal to or greater than ( T1TARGET.VALUE - 1).</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MAN</name>
                  <value>0</value>
                  <description>Manual mode.

Timer 1 stops and T1CTL.EN becomes 0 when the counter value becomes equal to or greater than T1TARGET.VALUE.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>T1CTL</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Timer 1 Control</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>EN</name>
              <description>[0:0] Timer 1 enable.

0: Disable Timer 1.
1: Enable Timer 1.

