novalabsxyz/cc13x2-cc26x2-pac/cc2652r1f.svd
        <register>
          <name>CPUIRQSEL33</name>
          <addressOffset>0x84</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 33</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>TRNG_IRQ</name>
                  <value>104</value>
                  <description>TRNG Interrupt event, controlled by TRNG:IRQEN.EN</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x68</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL34</name>
          <addressOffset>0x88</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 34</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>OSC_COMB</name>
                  <value>6</value>
                  <description>Combined event from Oscillator control</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x6</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL35</name>
          <addressOffset>0x8c</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 35</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AUX_TIMER2_EV0</name>
                  <value>56</value>
                  <description>AUX Timer2 event 0, corresponding to flag AUX_EVCTL:EVTOMCUFLAGS.AUX_TIMER2_EV0</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x38</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL36</name>
          <addressOffset>0x90</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 36</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>UART1_COMB</name>
                  <value>37</value>
                  <description>UART1 combined interrupt, interrupt flags are found here UART1:MIS</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x25</resetValue>
        </register>
        <register>
          <name>CPUIRQSEL37</name>
          <addressOffset>0x94</addressOffset>
          <size>32</size>
          <description>Output Selection for CPU Interrupt 37</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>BATMON_COMB</name>
                  <value>5</value>
                  <description>Combined event from battery monitor</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x5</resetValue>
        </register>
        <register>
          <name>RFCSEL0</name>
          <addressOffset>0x100</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 0</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT0A_CMP</name>
                  <value>61</value>
                  <description>GPT0A compare event. Configured by GPT0:TAMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x3D</resetValue>
        </register>
        <register>
          <name>RFCSEL1</name>
          <addressOffset>0x104</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 1</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT0B_CMP</name>
                  <value>62</value>
                  <description>GPT0B compare event. Configured by GPT0:TBMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x3E</resetValue>
        </register>
        <register>
          <name>RFCSEL2</name>
          <addressOffset>0x108</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 2</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT1A_CMP</name>
                  <value>63</value>
                  <description>GPT1A compare event. Configured by GPT1:TAMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x3F</resetValue>
        </register>
        <register>
          <name>RFCSEL3</name>
          <addressOffset>0x10c</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 3</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT1B_CMP</name>
                  <value>64</value>
                  <description>GPT1B compare event. Configured by GPT1:TBMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x40</resetValue>
        </register>
        <register>
          <name>RFCSEL4</name>
          <addressOffset>0x110</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 4</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT2A_CMP</name>
                  <value>65</value>
                  <description>GPT2A compare event. Configured by GPT2:TAMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x41</resetValue>
        </register>
        <register>
          <name>RFCSEL5</name>
          <addressOffset>0x114</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 5</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT2B_CMP</name>
                  <value>66</value>
                  <description>GPT2B compare event. Configured by GPT2:TBMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x42</resetValue>
        </register>
        <register>
          <name>RFCSEL6</name>
          <addressOffset>0x118</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 6</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3A_CMP</name>
                  <value>67</value>
                  <description>GPT3A compare event. Configured by GPT3:TAMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x43</resetValue>
        </register>
        <register>
          <name>RFCSEL7</name>
          <addressOffset>0x11c</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 7</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>GPT3B_CMP</name>
                  <value>68</value>
                  <description>GPT3B compare event. Configured by GPT3:TBMR.TCACT</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x44</resetValue>
        </register>
        <register>
          <name>RFCSEL8</name>
          <addressOffset>0x120</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 8</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_RTC_UPD</name>
                  <value>119</value>
                  <description>RTC periodic event controlled by AON_RTC:CTL.RTC_UPD_EN</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x77</resetValue>
        </register>
        <register>
          <name>RFCSEL9</name>
          <addressOffset>0x124</addressOffset>
          <size>32</size>
          <description>Output Selection for RFC Event 9</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read/write selection value

