novalabsxyz/cc13x2-cc26x2-pac/cc2652r1f.svd
Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <value>84</value>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <value>83</value>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <value>82</value>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <value>81</value>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <value>80</value>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <value>79</value>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <value>78</value>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <value>77</value>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TIE_LOW</name>
                  <value>72</value>
                  <description>Not used tied to 0</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x48</resetValue>
        </register>
        <register>
          <name>UDMACH12BSEL</name>
          <addressOffset>0x564</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 12 REQ

DMA_DONE for the corresponding DMA channel is available as interrupt on GPT1 as GPT1:RIS.DMABRIS</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read/write selection value

Writing any other value than values defined by a ENUM may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>ALWAYS_ACTIVE</name>
                  <value>121</value>
                  <description>Always asserted</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3B_DMABREQ</name>
                  <value>84</value>
                  <description>GPT3B DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT3A_DMABREQ</name>
                  <value>83</value>
                  <description>GPT3A DMA trigger event. Configured by GPT3:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2B_DMABREQ</name>
                  <value>82</value>
                  <description>GPT2B DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT2A_DMABREQ</name>
                  <value>81</value>
                  <description>GPT2A DMA trigger event. Configured by GPT2:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1B_DMABREQ</name>
                  <value>80</value>
                  <description>GPT1B DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT1A_DMABREQ</name>
                  <value>79</value>
                  <description>GPT1A DMA trigger event. Configured by GPT1:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0B_DMABREQ</name>
                  <value>78</value>
                  <description>GPT0B DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>GPT0A_DMABREQ</name>
                  <value>77</value>
                  <description>GPT0A DMA trigger event. Configured by GPT0:DMAEV</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>NONE</name>
                  <value>0</value>
                  <description>Always inactive</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x50</resetValue>
        </register>
        <register>
          <name>UDMACH13SSEL</name>
          <addressOffset>0x568</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_PROG2</name>
                  <value>3</value>
                  <description>AON programmable event 2. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG2_EV</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x3</resetValue>
        </register>
        <register>
          <name>UDMACH13BSEL</name>
          <addressOffset>0x56c</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 13 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read only selection value</description>
              <bitWidth>7</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_PROG2</name>
                  <value>3</value>
                  <description>AON programmable event 2. Event selected by AON_EVENT MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG2_EV</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x3</resetValue>
        </register>
        <register>
          <name>UDMACH14SSEL</name>
          <addressOffset>0x570</addressOffset>
          <size>32</size>
          <description>Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
          <fields>
            <field>
              <name>EV</name>
              <description>[31:0] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>AON_PROG0</name>
                  <value>1</value>
                  <description>AON programmable event 0. Event selected by AON_EVENT  MCU event selector, AON_EVENT:EVTOMCUSEL.AON_PROG0_EV</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>UDMACH14BSEL</name>
          <addressOffset>0x574</addressOffset>
          <size>32</size>
          <description>Output Selection for DMA Channel 14 REQ</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:7] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>25</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>EV</name>
              <description>[6:0] Read/write selection value

