novalabsxyz/cc13x2-cc26x2-pac/cc2652r1f.svd
        <register>
          <name>VOLT_TRIM</name>
          <addressOffset>0x388</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:29] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>VDDR_TRIM_HH</name>
              <description>[28:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[23:21] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>VDDR_TRIM_H</name>
              <description>[20:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[15:13] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>13</bitOffset>
            </field>
            <field>
              <name>VDDR_TRIM_SLEEP_H</name>
              <description>[12:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED0</name>
              <description>[7:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TRIMBOD_H</name>
              <description>[4:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xE0E0E0E0</resetValue>
        </register>
        <register>
          <name>OSC_CONF</name>
          <addressOffset>0x38c</addressOffset>
          <size>32</size>
          <description>OSC Configuration</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:30] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>30</bitOffset>
            </field>
            <field>
              <name>ADC_SH_VBUF_EN</name>
              <description>[29:29] Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_VBUF_EN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>ADC_SH_MODE_EN</name>
              <description>[28:28] Trim value for DDI_0_OSC:ADCDOUBLERNANOAMPCTL.ADC_SH_MODE_EN.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>28</bitOffset>
            </field>
            <field>
              <name>ATESTLF_RCOSCLF_IBIAS_TRIM</name>
              <description>[27:27] Trim value for DDI_0_OSC:ATESTCTL.ATESTLF_RCOSCLF_IBIAS_TRIM.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>XOSCLF_REGULATOR_TRIM</name>
              <description>[26:25] Trim value for DDI_0_OSC:LFOSCCTL.XOSCLF_REGULATOR_TRIM.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>XOSCLF_CMIRRWR_RATIO</name>
              <description>[24:21] Trim value for DDI_0_OSC:LFOSCCTL.XOSCLF_CMIRRWR_RATIO.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>21</bitOffset>
            </field>
            <field>
              <name>XOSC_HF_FAST_START</name>
              <description>[20:19] Trim value for DDI_0_OSC:CTL1.XOSC_HF_FAST_START.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>19</bitOffset>
            </field>
            <field>
              <name>XOSC_OPTION</name>
              <description>[18:18] 0: XOSC_HF unavailable (may not be bonded out)
1: XOSC_HF available (default)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>18</bitOffset>
            </field>
            <field>
              <name>HPOSC_OPTION</name>
              <description>[17:17] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>17</bitOffset>
            </field>
            <field>
              <name>HPOSC_BIAS_HOLD_MODE_EN</name>
              <description>[16:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>HPOSC_CURRMIRR_RATIO</name>
              <description>[15:12] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>HPOSC_BIAS_RES_SET</name>
              <description>[11:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HPOSC_FILTER_EN</name>
              <description>[7:7] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>HPOSC_BIAS_RECHARGE_DELAY</name>
              <description>[6:5] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[4:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>HPOSC_SERIES_CAP</name>
              <description>[2:1] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>HPOSC_DIV3_BYPASS</name>
              <description>[0:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xF00900E6</resetValue>
        </register>
        <register>
          <name>FREQ_OFFSET</name>
          <addressOffset>0x390</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>HPOSC_COMP_P0</name>
              <description>[31:16] Internal. Only to be used through TI provided API.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>HPOSC_COMP_P1</name>
              <description>[15:8] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>HPOSC_COMP_P2</name>
              <description>[7:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MISC_OTP_DATA_1</name>
          <addressOffset>0x398</addressOffset>
          <size>32</size>
          <description>Internal. Only to be used through TI provided API.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:29] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>29</bitOffset>
            </field>
            <field>
              <name>PEAK_DET_ITRIM</name>
              <description>[28:27] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>27</bitOffset>
            </field>
            <field>
              <name>HP_BUF_ITRIM</name>
              <description>[26:24] Internal. Only to be used through TI provided API.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>LP_BUF_ITRIM</name>
              <description>[23:22] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>22</bitOffset>
            </field>
            <field>
              <name>DBLR_LOOP_FILTER_RESET_VOLTAGE</name>
              <description>[21:20] Internal. Only to be used through TI provided API.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>20</bitOffset>
            </field>
            <field>
              <name>HPM_IBIAS_WAIT_CNT</name>
              <description>[19:10] Internal. Only to be used through TI provided API.</description>
              <bitWidth>10</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>LPM_IBIAS_WAIT_CNT</name>
              <description>[9:4] Internal. Only to be used through TI provided API.</description>
              <bitWidth>6</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>IDAC_STEP</name>
              <description>[3:0] Internal. Only to be used through TI provided API.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xE08403F8</resetValue>
        </register>
        <register>
          <name>PWD_CURR_20C</name>
          <addressOffset>0x39c</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 20C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x80BA608</resetValue>
        </register>
        <register>
          <name>PWD_CURR_35C</name>
          <addressOffset>0x3a0</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 35C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xC10A50A</resetValue>
        </register>
        <register>
          <name>PWD_CURR_50C</name>
          <addressOffset>0x3a4</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 50C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1218A20D</resetValue>
        </register>
        <register>
          <name>PWD_CURR_65C</name>
          <addressOffset>0x3a8</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 65C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1C259C14</resetValue>
        </register>
        <register>
          <name>PWD_CURR_80C</name>
          <addressOffset>0x3ac</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 80C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x2E3B9021</resetValue>
        </register>
        <register>
          <name>PWD_CURR_95C</name>
          <addressOffset>0x3b0</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 95C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x4C627A3B</resetValue>
        </register>
        <register>
          <name>PWD_CURR_110C</name>
          <addressOffset>0x3b4</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 110C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x789E706B</resetValue>
        </register>
        <register>
          <name>PWD_CURR_125C</name>
          <addressOffset>0x3b8</addressOffset>
          <size>32</size>
          <description>Power Down Current Control 125C</description>
          <fields>
            <field>
              <name>DELTA_CACHE_REF</name>
              <description>[31:24] Additional maximum current, in units of 1uA, with cache retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>DELTA_RFMEM_RET</name>
              <description>[23:16] Additional maximum current, in 1uA units, with RF memory retention</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DELTA_XOSC_LPM</name>
              <description>[15:8] Additional maximum current, in units of 1uA, with XOSC_HF on in low-power mode</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>BASELINE</name>
              <description>[7:0] Worst-case baseline maximum powerdown current, in units of 0.5uA</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0xADE1809A</resetValue>
        </register>
        <register>
          <name>SHDW_DIE_ID_0</name>
          <addressOffset>0x3d0</addressOffset>
          <size>32</size>
          <description>Shadow of DIE_ID_0 register in eFuse</description>
          <fields>
            <field>
              <name>ID_31_0</name>
              <description>[31:0] Shadow of DIE_ID_0 register in eFuse row number 5</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SHDW_DIE_ID_1</name>
          <addressOffset>0x3d4</addressOffset>
          <size>32</size>
          <description>Shadow of DIE_ID_1 register in eFuse</description>
          <fields>
            <field>
              <name>ID_63_32</name>
              <description>[31:0] Shadow of DIE_ID_1 register in eFuse row number 6</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SHDW_DIE_ID_2</name>
          <addressOffset>0x3d8</addressOffset>
          <size>32</size>
          <description>Shadow of DIE_ID_2 register in eFuse</description>
          <fields>
            <field>
              <name>ID_95_64</name>
              <description>[31:0] Shadow of DIE_ID_2 register in eFuse row number 7</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
