novalabsxyz/cc13x2-cc26x2-pac/cc2652r1f.svd
Based on the value in the register field TAMR.TAILD, this register is updated with the value from TAPR register either on the next cycle or on the next timeout.


This register shows the current value of the Timer A pre-scaler in the 16-bit mode.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PSS</name>
              <description>[7:0] GPT Timer A Pre-scaler</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TBPS</name>
          <addressOffset>0x60</addressOffset>
          <size>32</size>
          <description>Timer B Pre-scale Snap-shot 

Based on the value in the register field TBMR.TBILD, this register is updated with the value from TBPR register either on the next cycle or on the next timeout.

This register shows the current value of the Timer B pre-scaler in the 16-bit mode.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PSS</name>
              <description>[7:0] GPT Timer B Pre-scaler</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TAPV</name>
          <addressOffset>0x64</addressOffset>
          <size>32</size>
          <description>Timer A Pre-scale Value 
This register shows the current value of the Timer A free running pre-scaler in the 16-bit mode.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PSV</name>
              <description>[7:0] GPT Timer A Pre-scaler Value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>TBPV</name>
          <addressOffset>0x68</addressOffset>
          <size>32</size>
          <description>Timer B Pre-scale Value 
This register shows the current value of the Timer B free running pre-scaler in the 16-bit mode.</description>
          <fields>
            <field>
              <name>RESERVED8</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>PSV</name>
              <description>[7:0] GPT Timer B Pre-scaler Value</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DMAEV</name>
          <addressOffset>0x6c</addressOffset>
          <size>32</size>
          <description>DMA Event 
This register allows software to enable/disable GPT DMA trigger events.</description>
          <fields>
            <field>
              <name>RESERVED12</name>
              <description>[31:12] Software should not rely on the value of a reserved field.  Writing any other value may result in undefined behavior.</description>
              <bitWidth>20</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>TBMDMAEN</name>
              <description>[11:11] GPT Timer B Match DMA Trigger Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CBEDMAEN</name>
              <description>[10:10] GPT Timer B Capture Event DMA Trigger Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>CBMDMAEN</name>
              <description>[9:9] GPT Timer B Capture Match DMA Trigger Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>TBTODMAEN</name>
              <description>[8:8] GPT Timer B Time-Out DMA Trigger Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED5</name>
              <description>[7:5] Software should not rely on the value of a reserved field.  Writing any other value may result in undefined behavior.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>TAMDMAEN</name>
              <description>[4:4] GPT Timer A Match DMA Trigger Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RESERVED3</name>
              <description>[3:3] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CAEDMAEN</name>
              <description>[2:2] GPT Timer A Capture Event DMA Trigger Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CAMDMAEN</name>
              <description>[1:1] GPT Timer A Capture Match DMA Trigger Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TATODMAEN</name>
              <description>[0:0] GPT Timer A Time-Out DMA Trigger Enable</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>VERSION</name>
          <addressOffset>0xfb0</addressOffset>
          <size>32</size>
          <description>Peripheral Version
This register provides information regarding the GPT version</description>
          <fields>
            <field>
              <name>VERSION</name>
              <description>[31:0] Timer Revision.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x400</resetValue>
        </register>
        <register>
          <name>ANDCCP</name>
          <addressOffset>0xfb4</addressOffset>
          <size>32</size>
          <description>Combined CCP Output
This register is used to logically AND CCP output pairs for each timer</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>LD_TO_EN</name>
              <description>[1:1] PWM assertion would happen at timeout

0: PWM assertion happens when counter matches load value
1: PWM assertion happens at timeout of the counter</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>CCP_AND_EN</name>
              <description>[0:0] Enables AND operation of the CCP outputs for timers A and B.

0 : PWM outputs of Timer A and Timer B are the internal generated PWM signals of the respective timers.
1 : PWM output of Timer A is ANDed version of Timer A and Timer B PWM signals and Timer B PWM ouput is Timer B PWM signal only.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
