novalabsxyz/cc13x2-cc26x2-pac/cc2652r1f.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>PKA</name>
      <baseAddress>0x40025000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Integrated module which combines the Public Key Acceleration module, optional True Random Gnerator, optional interrupt controller and a standard bus interface</description>
      <registers>
        <register>
          <name>APTR</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>PKA Vector A Address
During execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Set to zero on write, ignore on read</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>APTR</name>
              <description>[10:0] This register specifies the location of vector A within the PKA RAM. Vectors are identified through the location of their least-significant 32-bit word. Note that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary.</description>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>BPTR</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>PKA Vector B Address
During execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Set to zero on write, ignore on read</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>BPTR</name>
              <description>[10:0] This register specifies the location of vector B within the PKA RAM. Vectors are identified through the location of their least-significant 32-bit word. Note that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary.</description>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CPTR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>PKA Vector C Address
During execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Set to zero on write, ignore on read</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>CPTR</name>
              <description>[10:0] This register specifies the location of vector C within the PKA RAM. Vectors are identified through the location of their least-significant 32-bit word. Note that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary.</description>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DPTR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>PKA Vector D Address
During execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Set to zero on write, ignore on read</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>DPTR</name>
              <description>[10:0] This register specifies the location of vector D within the PKA RAM. Vectors are identified through the location of their least-significant 32-bit word. Note that bit [0] must be zero to ensure that the vector starts at an 8-byte boundary.</description>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>ALENGTH</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>PKA Vector A Length
During execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:9] Set to zero on write, ignore on read</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>ALENGTH</name>
              <description>[8:0] This register specifies the length (in 32-bit words) of Vector A.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>BLENGTH</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>PKA Vector B Length
During execution of basic PKCP operations, this register is double buffered and can be written with a new value for the next operation; when not written, the value remains intact. During the execution of sequencer-controlled complex operations, this register may not be written and its value is undefined at the conclusion of the operation. The driver software cannot rely on the written value to remain intact.</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:9] Set to zero on write, ignore on read</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>BLENGTH</name>
              <description>[8:0] This register specifies the length (in 32-bit words) of Vector B.</description>
              <bitWidth>9</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SHIFT</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>PKA Bit Shift Value
For basic PKCP operations, modifying the contents of this register is made impossible while the operation is being performed. For the ExpMod-variable and ExpMod-CRT operations, this register is used to indicate the number of odd powers to use (directly as a value in the range 1-16). For the ModInv and ECC operations, this register is used to hold a completion code.</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:5] Set to zero on write, ignore on read</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>NUM_BITS_TO_SHIFT</name>
              <description>[4:0] This register specifies the number of bits to shift the input vector (in the range 0-31) during a Rshift or Lshift operation.</description>
              <bitWidth>5</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>FUNCTION</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>PKA Function
This register contains the control bits to start basic PKCP as well as complex sequencer operations. The run bit can be used to poll for the completion of the operation. Modifying bits [11:0] is made impossible during the execution of a basic PKCP operation.
During the execution of sequencer-controlled complex operations, this register is modified, the run and stall result bits are set to zero at the conclusion, but other bits are undefined.

NOTE: Continuously reading this register to poll the run bit is not allowed when executing complex sequencer operations (the sequencer cannot access the PKCP when this is done). Leave at least one sysclk cycle between poll operations.</description>
          <fields>
            <field>
              <name>RESERVED25</name>
              <description>[31:25] Set to zero on write, ignore on read</description>
              <bitWidth>7</bitWidth>
              <bitOffset>25</bitOffset>
            </field>
            <field>
              <name>STALL_RESULT</name>
              <description>[24:24] When written with a 1b, updating of the COMPARE bit, MSW and DIVMSW registers, as well as resetting the run bit is stalled beyond the point that a running operation is actually finished. Use this to allow software enough time to read results from a previous operation when the newly started operation is known to take only a short amount of time. If a result is waiting, the result registers is updated and the run bit is reset in the clock cycle following writing the stall result bit back to 0b. The Stall result function may only be used for basic PKCP operations.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>RESERVED16</name>
              <description>[23:16] Set to zero on write, ignore on read</description>
              <bitWidth>8</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RUN</name>
              <description>[15:15] The host sets this bit to instruct the PKA module to begin processing the basic PKCP or complex sequencer operation. This bit is reset low automatically when the operation is complete.
After a reset, the run bit is always set to 1b. Depending on the option, program ROM or program RAM, the following applies:
Program ROM - The first sequencer instruction sets the bit to 0b. This is done immediately after the hardware reset is released.
Program RAM - The sequencer must set the bit to 0b. As a valid firmware may not have been loaded, the sequencer is held in software reset after the hardware reset is released (the SEQCTRL.RESET bit is set to 1b). After the FW image is loaded and the Reset bit is cleared, the sequencer starts to execute the FW. The first instruction clears the run bit.
In both cases a few clock cycles are needed before the first instruction is executed and the run bit state has been propagated.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>SEQUENCER_OPERATIONS</name>
              <description>[14:12] These bits select the complex sequencer operation to perform:     
0x0: None 
0x1: ExpMod-CRT 
0x2: ECmontMUL
0x3: ECC-ADD (if available in firmware, otherwise reserved) 
0x4: ExpMod-ACT2
0x5: ECC-MUL (if available in firmware, otherwise reserved) 
0x6: ExpMod-variable 
0x7: ModInv (if available in firmware, otherwise reserved)            
The encoding of these operations is determined by sequencer firmware.</description>
              <bitWidth>3</bitWidth>
              <bitOffset>12</bitOffset>
            </field>
            <field>
              <name>COPY</name>
              <description>[11:11] Perform copy operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>COMPARE</name>
              <description>[10:10] Perform compare operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>MODULO</name>
              <description>[9:9] Perform modulo operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>DIVIDE</name>
              <description>[8:8] Perform divide operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>LSHIFT</name>
              <description>[7:7] Perform left shift operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RSHIFT</name>
              <description>[6:6] Perform right shift operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>SUBTRACT</name>
              <description>[5:5] Perform subtract operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>ADD</name>
              <description>[4:4] Perform add operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MS_ONE</name>
              <description>[3:3] Loads the location of the Most Significant one bit within the result word indicated in the MSW register into bits [4:0] of the DIVMSW.MSW_ADDRESS register - can only be used with basic PKCP operations, except for Divide, Modulo and Compare.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RESERVED2</name>
              <description>[2:2] Set to zero on write, ignore on read</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>ADDSUB</name>
              <description>[1:1] Perform combined add/subtract operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MULTIPLY</name>
              <description>[0:0] Perform multiply operation</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x8000</resetValue>
        </register>
        <register>
          <name>COMPARE</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>PKA compare result
This register provides the result of a basic PKCP compare operation. It is updated when the FUNCTION.RUN bit is reset at the end of that operation.
Status after a complex sequencer operation is unknown</description>
          <fields>
            <field>
              <name>RESERVED3</name>
              <description>[31:3] Ignore on read</description>
              <bitWidth>29</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>A_GREATER_THAN_B</name>
              <description>[2:2] Vector_A is greater than Vector_B</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>A_LESS_THAN_B</name>
              <description>[1:1] Vector_A is less than Vector_B</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>A_EQUALS_B</name>
              <description>[0:0] Vector_A is equal to Vector_B</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>MSW</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>PKA most-significant-word of result vector
This register indicates the (word) address in the PKA RAM where the most significant nonzero 32-bit word of the result is stored. Should be ignored for modulo operations. For basic PKCP operations, this register is updated  FUNCTION.RUN bit is reset at the end of the operation. For the complex-sequencer controlled operations, updating of the final value matching the actual result is done near the end of the operation; note that the result is only meaningful if no errors were detected and that for ECC operations, this register will provide information for the x-coordinate of the result point only.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Ignore on read</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESULT_IS_ZERO</name>
              <description>[15:15] The result vector is all zeroes, ignore the address returned in bits [10:0]</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>RESERVED11</name>
              <description>[14:11] Ignore on read</description>
              <bitWidth>4</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MSW_ADDRESS</name>
              <description>[10:0] Address of the most-significant nonzero 32-bit word of the result vector in PKA RAM</description>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x8000</resetValue>
        </register>
        <register>
          <name>DIVMSW</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>PKA most-significant-word of divide remainder
This register indicates the (32-bit word) address in the PKA RAM where the most significant nonzero 32-bit word of the remainder result for the basic divide and modulo operations is stored. Bits [4:0] are loaded with the bit number of the most-significant nonzero bit in the most-significant nonzero word when MS one control bit is set. For divide, modulo, and MS one reporting, this register is updated when FUNCTION.RUN bit is reset at the end of the operation. For the complex sequencer controlled operations, updating of bits [4:0] of this register with the most-significant bit location of the actual result is done near the end of the operation. The result is meaningful only if no errors were detected and that for ECC operations; this register provides information for the x-coordinate of the result point only.</description>
          <fields>
            <field>
              <name>RESERVED16</name>
              <description>[31:16] Ignore on read</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>RESULT_IS_ZERO</name>
              <description>[15:15] The result vector is all zeroes, ignore the address returned in bits [10:0]</description>
              <bitWidth>1</bitWidth>
              <bitOffset>15</bitOffset>
            </field>
            <field>
              <name>RESERVED11</name>
              <description>[14:11] Ignore on read</description>
              <bitWidth>4</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>MSW_ADDRESS</name>
              <description>[10:0] Address of the most significant nonzero 32-bit word of the remainder result vector in PKA RAM</description>
              <bitWidth>11</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x8000</resetValue>
        </register>
        <register>
          <name>SEQCTRL</name>
          <addressOffset>0xc8</addressOffset>
          <size>32</size>
          <description>PKA sequencer control and status register
The sequencer is interfaced with the outside world through a single control and status register. With the exception of bit [31], the actual use of bits in the separate sub-fields of this register is determined by the sequencer firmware. This register need only be accessed when the sequencer program is stored in RAM. The reset value of the RESET bit depends upon the option chosen for sequencer program storage.                                                                                                                                                                   NOTE: For Agama the sequencer firmware is executed from ROM.</description>
          <fields>
            <field>
              <name>RESET</name>
              <description>[31:31] Option program ROM: Reset value = 0. Read/Write, reset value 0b (ZERO). Writing 1b resets the sequencer, write to 0b to restart operations again. As the reset value is 0b, the sequencer will automatically start operations executing from program ROM. This bit should always be written with zero and ignored when reading this register.

