novalabsxyz/cc13x2-cc26x2-pac/cc2652r1f.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>RFC_PWR</name>
      <baseAddress>0x40040000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x4</size>
        <usage>registers</usage>
      </addressBlock>
      <description>RF core power management

This module contains clock control for all RF core sub-modules.</description>
      <registers>
        <register>
          <name>PWMCLKEN</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>RF Core Power Management and Clock Enable</description>
          <fields>
            <field>
              <name>RESERVED11</name>
              <description>[31:11] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>21</bitWidth>
              <bitOffset>11</bitOffset>
            </field>
            <field>
              <name>RFCTRC</name>
              <description>[10:10] Enable clock to the RF Core Tracer (RFCTRC) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>10</bitOffset>
            </field>
            <field>
              <name>FSCA</name>
              <description>[9:9] Enable clock to the Frequency Synthesizer Calibration Accelerator (FSCA) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PHA</name>
              <description>[8:8] Enable clock to the Packet Handling Accelerator (PHA) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RAT</name>
              <description>[7:7] Enable clock to the Radio Timer (RAT) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
            </field>
            <field>
              <name>RFERAM</name>
              <description>[6:6] Enable clock to the RF Engine RAM module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
            </field>
            <field>
              <name>RFE</name>
              <description>[5:5] Enable clock to the RF Engine (RFE) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>MDMRAM</name>
              <description>[4:4] Enable clock to the Modem RAM module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>MDM</name>
              <description>[3:3] Enable clock to the Modem (MDM) module.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>CPERAM</name>
              <description>[2:2] Enable clock to the Command and Packet Engine (CPE) RAM module. As part of RF Core initialization, set this bit together with CPE bit to enable CPE to boot.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>CPE</name>
              <description>[1:1] Enable processor clock (hclk) to the Command and Packet Engine (CPE). As part of RF Core initialization, set this bit together with CPERAM bit to enable CPE to boot.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RFC</name>
              <description>[0:0] Enable essential clocks for the RF Core interface. This includes the interconnect, the radio doorbell DBELL command interface, the power management (PWR) clock control module, and bus clock (sclk) for the CPE. To remove possibility of locking yourself out from the RF Core, this bit can not be cleared. If you need to disable all clocks to the RF Core, see the PRCM:RFCCLKG.CLK_EN register.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>RFC_RAT</name>
      <baseAddress>0x40043000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x100</size>
        <usage>registers</usage>
      </addressBlock>
      <description>RF core radio timer</description>
      <registers>
        <register>
          <name>RATCNT</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Radio Timer Counter Value</description>
          <fields>
            <field>
              <name>CNT</name>
              <description>[31:0] Counter value. This is not writable while radio timer counter is enabled.</description>
              <bitWidth>32</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SMPH</name>
      <baseAddress>0x40084000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>MCU Semaphore Module

This module provides 32 binary semaphores. The state of a binary semaphore is either taken or available. 

A semaphore does not implement any ownership attribute. Still, a semaphore can be used to handle mutual exclusion scenarios.</description>
      <registers>
        <register>
          <name>SMPH0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 0</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 1</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH2</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 2</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH3</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 3</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH4</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 4</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH5</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 5</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH6</name>
          <addressOffset>0x18</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 6</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH7</name>
          <addressOffset>0x1c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 7</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH8</name>
          <addressOffset>0x20</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 8</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH9</name>
          <addressOffset>0x24</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 9</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH10</name>
          <addressOffset>0x28</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 10</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH11</name>
          <addressOffset>0x2c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 11</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH12</name>
          <addressOffset>0x30</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 12</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH13</name>
          <addressOffset>0x34</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 13</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH14</name>
          <addressOffset>0x38</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 14</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH15</name>
          <addressOffset>0x3c</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 15</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH16</name>
          <addressOffset>0x40</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 16</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH17</name>
          <addressOffset>0x44</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 17</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

Reading the register causes it to change value to 0. Releasing the semaphore is done by writing 1.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x1</resetValue>
        </register>
        <register>
          <name>SMPH18</name>
          <addressOffset>0x48</addressOffset>
          <size>32</size>
          <description>MCU SEMAPHORE 18</description>
          <fields>
            <field>
              <name>RESERVED1</name>
              <description>[31:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>31</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>STAT</name>
              <description>[0:0] Status when reading:

0: Semaphore is taken
1: Semaphore is available

