novalabsxyz/cc13x2-cc26x2-pac/cc2652r1f.svd
      </registers>
    </peripheral>
    <peripheral>
      <name>SRAM_MMR</name>
      <baseAddress>0x40035000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x5000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>General Purpose RAM</description>
      <registers>
        <register>
          <name>PER_CTL</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Parity Error Control 
Parity error check controls</description>
          <fields>
            <field>
              <name>RESERVED9</name>
              <description>[31:9] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>23</bitWidth>
              <bitOffset>9</bitOffset>
            </field>
            <field>
              <name>PER_DISABLE</name>
              <description>[8:8] Parity Status Disable

0: A parity error will update PER_CHK_PER_ADDR field
1: Parity error does not update PER_CHK_PER_ADDR field</description>
              <bitWidth>1</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>RESERVED1</name>
              <description>[7:1] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>7</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>PER_DEBUG_ENABLE</name>
              <description>[0:0] Parity Error Debug Enable

0: Normal operation
1: An address offset can be written to PER_DBG:PER_DEBUG_ADDR and parity errors will be generated on reads from within this offset</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PER_CHK</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Parity Error Check
Parity error check results</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>PER_ADDR</name>
              <description>[23:0] Parity Error Address Offset
Returns the last address offset which resulted in a parity error during an SRAM read.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>PER_DBG</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Parity Error Debug
Parity error check debug address setting</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:24] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>24</bitOffset>
            </field>
            <field>
              <name>PER_DEBUG_ADDR</name>
              <description>[23:0] Debug Parity Error Address Offset
When PER_CTL:PER_DEBUG is 1, this field is used to set an address offset so that writes to this address offset followed by reads from within this address offset will result in parity errors.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>MEM_CTL</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Memory Control
Controls memory initialization</description>
          <fields>
            <field>
              <name>RESERVED24</name>
              <description>[31:2] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>30</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>MEM_BUSY</name>
              <description>[1:1] Memory Busy status

0: Memory accepts transfers
1: Memory controller is busy during initialization. Read and write transfers are not performed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>MEM_CLR_EN</name>
              <description>[0:0] Memory Contents Initialization enable

Writing 1 to MEM_CLR_EN will start memory initialization. The contents of all byte locations will be initialized to 0x00. MEM_BUSY will be 1 until memory initialization has completed.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
      </registers>
    </peripheral>
    <peripheral>
      <name>SSI0</name>
      <baseAddress>0x40000000</baseAddress>
      <addressBlock>
        <offset>0</offset>
        <size>0x1000</size>
        <usage>registers</usage>
      </addressBlock>
      <description>Synchronous Serial Interface with master and slave capabilities</description>
      <registers>
        <register>
          <name>CR0</name>
          <addressOffset>0x0</addressOffset>
          <size>32</size>
          <description>Control 0</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>SCR</name>
              <description>[15:8] Serial clock rate:
This is used to generate the transmit and receive bit rate of the SSI. The bit rate is 
(SSI's clock frequency)/((SCR+1)*CPSR.CPSDVSR).
SCR is a value from 0-255.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>SPH</name>
              <description>[7:7] CLKOUT phase (Motorola SPI frame format only)
This bit selects the clock edge that captures data and enables it to change state. It
has the most impact on the first bit transmitted by either permitting or not permitting a clock transition before the first data capture edge.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>7</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>2ND_CLK_EDGE</name>
                  <value>1</value>
                  <description>Data is captured on the second clock edge transition.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>1ST_CLK_EDGE</name>
                  <value>0</value>
                  <description>Data is captured on the first clock edge transition.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SPO</name>
              <description>[6:6] CLKOUT polarity (Motorola SPI frame format only)</description>
              <bitWidth>1</bitWidth>
              <bitOffset>6</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>HIGH</name>
                  <value>1</value>
                  <description>SSI produces a steady state HIGH value on the CLKOUT pin when data is not being transferred.</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>LOW</name>
                  <value>0</value>
                  <description>SSI produces a steady state LOW value on the
CLKOUT pin when data is not being transferred.</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>FRF</name>
              <description>[5:4] Frame format. 
The supported frame formats are Motorola SPI, TI synchronous serial and National Microwire. 
Value 0'b11 is reserved and shall not be used.</description>
              <bitWidth>2</bitWidth>
              <bitOffset>4</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>NATIONAL_MICROWIRE</name>
                  <value>2</value>
                  <description>National Microwire frame format</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>TI_SYNC_SERIAL</name>
                  <value>1</value>
                  <description>TI synchronous serial frame format</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MOTOROLA_SPI</name>
                  <value>0</value>
                  <description>Motorola SPI frame format</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>DSS</name>
              <description>[3:0] Data Size Select. 
Values 0b0000, 0b0001, 0b0010 are reserved and shall not be used.</description>
              <bitWidth>4</bitWidth>
              <bitOffset>0</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>16_BIT</name>
                  <value>15</value>
                  <description>16-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>15_BIT</name>
                  <value>14</value>
                  <description>15-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>14_BIT</name>
                  <value>13</value>
                  <description>14-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>13_BIT</name>
                  <value>12</value>
                  <description>13-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>12_BIT</name>
                  <value>11</value>
                  <description>12-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>11_BIT</name>
                  <value>10</value>
                  <description>11-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>10_BIT</name>
                  <value>9</value>
                  <description>10-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>9_BIT</name>
                  <value>8</value>
                  <description>9-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>8_BIT</name>
                  <value>7</value>
                  <description>8-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>7_BIT</name>
                  <value>6</value>
                  <description>7-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>6_BIT</name>
                  <value>5</value>
                  <description>6-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>5_BIT</name>
                  <value>4</value>
                  <description>5-bit data</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>4_BIT</name>
                  <value>3</value>
                  <description>4-bit data</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>CR1</name>
          <addressOffset>0x4</addressOffset>
          <size>32</size>
          <description>Control 1</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>SOD</name>
              <description>[3:3] Slave-mode output disabled
This bit is relevant only in the slave mode, MS=1. In multiple-slave systems, it is possible for an SSI master to broadcast a message to all slaves in the system while ensuring that only one slave drives data onto its serial output line. In such systems the RXD lines from multiple slaves could be tied together. To operate in such systems, this bitfield can be set if the SSI slave is not supposed to drive the TXD line:

0: SSI can drive the TXD output in slave mode.
1: SSI cannot drive the TXD output in slave mode.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>MS</name>
              <description>[2:2] Master or slave mode select. This bit can be modified only when SSI is disabled, SSE=0.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SLAVE</name>
                  <value>1</value>
                  <description>Device configured as slave</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>MASTER</name>
                  <value>0</value>
                  <description>Device configured as master</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>SSE</name>
              <description>[1:1] Synchronous serial interface enable.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
              <enumeratedValues>
                <enumeratedValue>
                  <name>SSI_ENABLED</name>
                  <value>1</value>
                  <description>Operation enabled</description>
                </enumeratedValue>
                <enumeratedValue>
                  <name>SSI_DISABLED</name>
                  <value>0</value>
                  <description>Operation disabled</description>
                </enumeratedValue>
              </enumeratedValues>
            </field>
            <field>
              <name>LBM</name>
              <description>[0:0] Loop back mode:

0: Normal serial port operation enabled.
1: Output of transmit serial shifter is connected to input of receive serial shifter internally.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>DR</name>
          <addressOffset>0x8</addressOffset>
          <size>32</size>
          <description>Data
16-bits wide data register:
When read, the entry in the receive FIFO, pointed to by the current FIFO read pointer, is accessed. As data values are removed by the  receive logic from the incoming data frame, they are placed into the entry in the receive FIFO, pointed to by the current FIFO write pointer.
When written, the entry in the transmit FIFO, pointed to by the write pointer, is written to. Data values are removed from the transmit FIFO one value at a time by the transmit logic. It is loaded into the transmit serial shifter, then serially shifted out onto the TXD output pin at the programmed bit rate.
When a data size of less than 16 bits is selected, the user must right-justify data written to the transmit FIFO. The transmit logic ignores the unused bits. Received data less than 16 bits is automatically right-justified in the receive buffer.</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:16] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>16</bitOffset>
            </field>
            <field>
              <name>DATA</name>
              <description>[15:0] Transmit/receive data
The values read from this field or written to this field must be right-justified when SSI is programmed for a data size that is less than 16 bits (CR0.DSS != 0b1111). Unused bits at the top are ignored by transmit logic. The receive logic automatically right-justifies.</description>
              <bitWidth>16</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>SR</name>
          <addressOffset>0xc</addressOffset>
          <size>32</size>
          <description>Status</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:5] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>27</bitWidth>
              <bitOffset>5</bitOffset>
            </field>
            <field>
              <name>BSY</name>
              <description>[4:4] Serial interface busy:

0: SSI is idle
1: SSI is currently transmitting and/or receiving a frame or the transmit FIFO is not empty.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>RFF</name>
              <description>[3:3] Receive FIFO full:

0: Receive FIFO is not full.
1: Receive FIFO is full.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RNE</name>
              <description>[2:2] Receive FIFO not empty

0: Receive FIFO is empty.
1: Receive FIFO is not empty.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>TNF</name>
              <description>[1:1] Transmit FIFO not full:

0: Transmit FIFO is full.
1: Transmit FIFO is not full.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>TFE</name>
              <description>[0:0] Transmit FIFO empty:

0: Transmit FIFO is not empty.
1: Transmit FIFO is empty.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x3</resetValue>
        </register>
        <register>
          <name>CPSR</name>
          <addressOffset>0x10</addressOffset>
          <size>32</size>
          <description>Clock Prescale</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:8] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>24</bitWidth>
              <bitOffset>8</bitOffset>
            </field>
            <field>
              <name>CPSDVSR</name>
              <description>[7:0] Clock prescale divisor:
This field specifies the division factor by which the input system clock to SSI must be internally divided before further use.
The value programmed into this field must be an even non-zero number (2-254). The least significant bit of the programmed number is hard-coded to zero. If an odd number is written to this register, data read back from
this register has the least significant bit as zero.</description>
              <bitWidth>8</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
        <register>
          <name>IMSC</name>
          <addressOffset>0x14</addressOffset>
          <size>32</size>
          <description>Interrupt Mask Set and Clear</description>
          <fields>
            <field>
              <name>RESERVED</name>
              <description>[31:4] Software should not rely on the value of a reserved. Writing any other value than the reset value may result in undefined behavior.</description>
              <bitWidth>28</bitWidth>
              <bitOffset>4</bitOffset>
            </field>
            <field>
              <name>TXIM</name>
              <description>[3:3] Transmit FIFO interrupt mask:
A read returns the current mask for transmit FIFO interrupt. On a write of 1, the mask for transmit FIFO interrupt is set which means the interrupt state will be reflected in MIS.TXMIS. A write of 0 clears the mask which means MIS.TXMIS will not reflect the interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>3</bitOffset>
            </field>
            <field>
              <name>RXIM</name>
              <description>[2:2] Receive FIFO interrupt mask:
A read returns the current mask for receive FIFO interrupt. On a write of 1, the mask for receive FIFO interrupt is set which means the interrupt state will be reflected in MIS.RXMIS. A write of 0 clears the mask which means MIS.RXMIS will not reflect the interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>2</bitOffset>
            </field>
            <field>
              <name>RTIM</name>
              <description>[1:1] Receive timeout interrupt mask:
A read returns the current mask for receive timeout interrupt. On a write of 1, the mask for receive timeout interrupt is set which means the interrupt state will be reflected in MIS.RTMIS. A write of 0 clears the mask which means MIS.RTMIS will not reflect the interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>1</bitOffset>
            </field>
            <field>
              <name>RORIM</name>
              <description>[0:0] Receive overrun interrupt mask:
A read returns the current mask for receive overrun interrupt. On a write of 1, the mask for receive overrun interrupt is set which means the interrupt state will be reflected in MIS.RORMIS. A write of 0 clears the mask which means MIS.RORMIS will not reflect the interrupt.</description>
              <bitWidth>1</bitWidth>
              <bitOffset>0</bitOffset>
            </field>
          </fields>
          <resetValue>0x0</resetValue>
        </register>
